---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ColorFillSwatchHeightParam
source: html/26f93fe5-f40a-13e2-7413-2ae27ea6722c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ColorFillSwatchHeightParam Property

"Swatch Height"

## Syntax (C#)
```csharp
public static ForgeTypeId ColorFillSwatchHeightParam { get; }
```